backend/data/payload_pull_msr.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tdpplv1="http://datex2.eu/wsdl/TDP/Soap_Datex2/Pull/v1" xmlns:dx223="http://datex2.eu/schema/2/2_0">
	<SOAP-ENV:Body>
		<dx223:d2LogicalModel xsi:type="dx223:D2LogicalModel" modelBaseVersion="2">
			<dx223:exchange xsi:type="dx223:Exchange">
				<dx223:supplierIdentification xsi:type="dx223:InternationalIdentifier">
                    <dx223:country xsi:type="dx223:CountryEnum">ch</dx223:country>
                    <dx223:nationalIdentifier xsi:type="dx223:String">FEDRO</dx223:nationalIdentifier>
				</dx223:supplierIdentification>
			</dx223:exchange>
            <dx223:payloadPublication xsi:type="dx223:GenericPublication" lang="en">
				<dx223:publicationTime xsi:type="dx223:DateTime">2020-02-26T15:50:46Z</dx223:publicationTime>
					<dx223:publicationCreator xsi:type="dx223:InternationalIdentifier">
						<dx223:country xsi:type="dx223:CountryEnum">ch</dx223:country>
						<dx223:nationalIdentifier xsi:type="dx223:String">FEDRO</dx223:nationalIdentifier>
					</dx223:publicationCreator>
					<dx223:genericPublicationName xsi:type="dx223:String">MeasuredDataFilter</dx223:genericPublicationName>
					<dx223:genericPublicationExtension xsi:type="dx223:_GenericPublicationExtensionType">
						<dx223:measuredDataFilter xsi:type="dx223:MeasuredDataFilter">
							<dx223:measurementSiteTableReference xsi:type="dx223:_MeasurementSiteTableVersionedReference" targetClass="MeasurementSiteTable" id="OTD:TrafficData" version="0"></dx223:measurementSiteTableReference>
							<dx223:siteRequestReference xsi:type="dx223:_MeasurementSiteRecordVersionedReference" targetClass="MeasurementSiteRecord" id="CH:+.+" version="0"></dx223:siteRequestReference>
						</dx223:measuredDataFilter>
					</dx223:genericPublicationExtension>
			</dx223:payloadPublication>
		</dx223:d2LogicalModel>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

